<template>
  <div>
    <h1>Теория</h1>
    <v-card
      elevation="2"
    >
      <v-card-title>Алгоритм Бойера-Мура</v-card-title>

      <v-card-text>
        Алгоритм Бойера-Мура, разработанный двумя учеными — Бойером (Robert S. Boyer) и Муром (J. Strother Moore), считается наиболее быстрым среди алгоритмов общего назначения, предназначенных для поиска подстроки в строке. Важной особенностью алгоритма является то, что он выполняет сравнения в шаблоне справа налево в отличие от многих других алгоритмов.

  Алгоритм Бойера-Мура считается наиболее эффективным алгоритмом поиска шаблонов в стандартных приложениях и командах, таких как Ctrl+F в браузерах и текстовых редакторах.
      </v-card-text>
    </v-card>
  </div>  
</template>

<script>
import 'prettify'; 

export default {
  
}
</script>
